var shawarma = {
  'meals': [
    {
      'id': 1,
      'name': 'وجبة عادي',
      'price': 2.25,
    },
    {
      'id': 2,
      'name': 'وجبة سوبر',
      'price': 3.00,
    },
    {
      'id': 3,
      'name': 'وجبة دبل',
      'price': 3.45,
    },
    {
      'id': 4,
      'name': 'وجبة تريبل',
      'price': 4.45,
    },
    {
      'id': 5,
      'name': 'وجبة شاورما كريمة',
      'price': 3.25,
    },
    {
      'id': 6,
      'name': 'وجبة شاورما باربكيو',
      'price': 3.25,
    },
  ],
  'sandwitch': [
    {
      'id': 7,
      'name': 'شاورما صاج',
      'price': 1.50,
    },
    {
      'id': 8,
      'name': 'شاورما فرنسي',
      'price': 1.60,
    },
    {
      'id': 9,
      'name': ' شاورما كريمة',
      'price': 2.25,
    },
    {
      'id': 10,
      'name': 'شاورما باربكيو',
      'price': 2.25,
    },
  ]
};

var snacks = {
  'meals': [
    {
      'name': 'وجبة زنجر فرنسي',
      'price': 3.20,
    },
    {
      'name': 'وجبة زنجر مطافي',
      'price': 3.20,
    },
    {
      'name': 'وجبة زنجر كريمة',
      'price': 4.00,
    },
    {
      'name': 'وجبة كوردن بلو',
      'price': 3.00,
    },
    {
      'name': 'وجبة فاهيتا',
      'price': 3.00,
    },
    {
      'name': 'وجبة تشكن ألفريدو',
      'price': 3.30,
    },
    {
      'name': 'وجبة تشكن باربكيو',
      'price': 3.30,
    },
    {
      'name': ' وجبة اسكالوب',
      'price': 2.25,
    },
    {
      'name': ' وجبة برغر لحمة(150غ)',
      'price': 3.50,
    },
    {
      'name': ' وجبة ستيك جودي',
      'price': 3.50,
    }
  ],
  'sandwitch': [
    {
      'name': 'ساندويش زنجر فرنسي',
      'price': 2.25,
    },
    {
      'name': 'ساندويش زنجر مطافي',
      'price': 2.25,
    },
    {
      'name': 'ساندويش زنجر كريمة',
      'price': 3.00,
    },
    {
      'name': 'ساندويش كوردن بلو',
      'price': 2.00,
    },
    {
      'name': 'ساندويش فاهيتا',
      'price': 2.00,
    },
    {
      'name': 'ساندويش تشكن ألفريدو',
      'price': 2.25,
    },
    {
      'name': 'ساندويش تشكن باربكيو',
      'price': 2.15,
    },
    {
      'name': 'ساندويش اسكالوب',
      'price': 1.00,
    },
    {
      'name': ' ساندويش برغر لحمة(150غ)',
      'price': 2.50,
    },
    {
      'name': 'ساندويش ستيك جودي',
      'price': 2.50,
    }
  ],
};

var italy = [
  {'name': 'وجبة إيطالي', 'price': 4.00},
  {'name': 'وجبة إيطالي كريمة وفطر', 'price': 4.00},
  {'name': 'وجبة إيطالي باربكيو وفطر', 'price': 4.00},
  {'name': 'وجبة حلبي', 'price': 4.00},
];

var drinks = [
  {'name': 'كوكاكولا', 'price': 0.40},
  {'name': 'كولا لتر ', 'price': 0.75},
  {'name': 'سبرايت', 'price': 0.40},
  {'name': 'فانتـا', 'price': 0.40},
  {'name': 'عصير', 'price': 0.25},
  {'name': 'مياه معدنية', 'price': 0.35},
];

var additions = [
  {
    'name': 'بطاطا عادي ',
    'price': 0.75,
  },
  {
    'name': 'بطاطا مع جبنة ',
    'price': 1.25,
  },
  {
    'name': 'بطاطا ودجز ',
    'price': 1.25,
  },
  {
    'name': 'مثومة',
    'price': 0.25,
  },
  {
    'name': 'جبنة',
    'price': 0.50,
  },
  {
    'name': 'حلقات بصل',
    'price': 1.50,
  },
  {
    'name': 'اصابع موزاريلا',
    'price': 2.00,
  },
  {
    'name': 'تشكن ناجتس',
    'price': 2.00,
  },
  {
    'name': 'أجنحة دجاج بالباربكيو(6 حبات)',
    'price': 2.50,
  }
];

var familymeals = [
  {
    'name': 'كومبو 1',
    'price': 2.90,
    'desc': '(2 ساندويش سكالوب + بطاطا + كولا صغير)'
  },
  {
    'name': 'كومبو 2',
    'price': 5.90,
    'desc': '(2 ساندويش سكالوب + 2 ساندويش شاورما+ بطاطا وسط + كولا 1 لتر)'
  },
  {
    'name': 'كومبو 3',
    'price': 7.50,
    'desc': '(4 ساندويش شاورما "كبير" + بطاطا كبير +3 مثومة + كولا 1 لتر)'
  },
  {
    'name': 'كومبو 4',
    'price': 12.50,
    'desc': '(7 ساندويش شاورما "كبير" + بطاطا كبير +5 مثومة + كولا 1 لتر)'
  },
  {
    'name': 'كومبو 5',
    'price': 16.50,
    'desc': '(10 ساندويش شاورما "كبير" + بطاطا كبير +7 مثومة + كولا 1 لتر)'
  },
  {
    'name': 'كومبو 6',
    'price': 19.90,
    'desc':
        '(7 ساندويش شاورما "كبير" + 4 ساندويش سكالوب + 2 زنجر + 2 بطاطا كبير + كولا 2 لتر)'
  },
  {
    'name': 'كومبو 7',
    'price': 10.00,
    'desc': '(4 ساندويش زنجر + 1 بطاطا كبير +كولا 1 لتر)'
  },
  {
    'name': 'كومبو 8',
    'price': 10.00,
    'desc': '(5 ساندويش كوردن بلو + 1 بطاطا كبير +كولا 1 لتر)'
  },
];

var staff = {
  'meals': [
    {
      'name': 'وجبة عادي',
      'price': 2.00,
    },
    {
      'name': 'وجبة سوبر ',
      'price': 2.50,
    },
    {
      'name': 'وجبة دبل',
      'price': 3.00,
    },
    {
      'name': 'وجبة إيطالي',
      'price': 3.50,
    },
    {
      'name': ' وجبة اسكالوب',
      'price': 2.00,
    },
    {
      'name': ' وجبة كومبو اسكالوب',
      'price': 2.25,
    },
    {
      'name': 'وجبة زنجر ',
      'price': 2.25,
    },
    {
      'name': 'وجبة كوردن بلو',
      'price': 2.25,
    },
    {
      'name': 'وجبة زنجر كريمة',
      'price': 2.50,
    },
    {
      'name': 'وجبة جاج بالكريمة',
      'price': 2.25,
    },
  ],
  'sandwitch': [
    {
      'name': 'ساندويش شاورما',
      'price': 1.00,
    },
    {
      'name': 'ساندويش زنجر',
      'price': 1.50,
    },
    {
      'name': 'ساندويش كوردن بلو',
      'price': 1.50,
    },
    {
      'name': 'ساندويش اسكالوب',
      'price': 1.00,
    },
    {
      'name': 'ساندويش بطاطا',
      'price': 1.00,
    },
    {
      'name': 'ساندويش زنجر كريمة',
      'price': 1.75,
    },
    {
      'name': 'ساندويش جاج بالكريمة',
      'price': 1.50,
    },
  ]
};
